Repository: FrancescaForbicini/Design-and-Implementation-of-Mobile-Application
Catalog: lib/l10n/intl_*.arb
Languages: it

# SignupErrEmail
source: Invalid Email
it: Email non valida

# SignupErrPwd
source: Password cannot be empty or shorter than 6 characters
it: La password non può essere vuota o più corta di 6 caratteri

# SignupErrMatchPwd
source: The passwords do not match
it: Le password non corrispondono

# SignupEmptyUser
source: Username cannot be empty
it: Lo username non può essere vuoto

# SignupTitle
source: Sign Up
it: Registrati

# SignupConfirmPwd
source: Confirm Password
it: Conferma password

# SignupButton
source: SIGN UP
it: REGISTRATI

# SigninTitle
source: Sign In
it: Accedi

# SigninButton
source: SIGN IN
it: ACCEDI

# SigninErr
source: Error
it: Errore

# SigninErrText
source: Invalid email or password
it: Email o password non corrette

# AuthSignin
source: Sign in
it: Accedi

# AuthSignup
source: Sign up
it: Registrati

# AuthGoogle
source: Sign in with Google
it: Accedi con Google

# HomeTitle
source: Home Page
it: La tua Home Page

# HomeStart
source: Start a new quiz!
it: Comincia un nuovo quiz!

# HomePlaylist
source: Your playlists:
it: Le tue playlists:

# HomeArtists
source: Your artists:
it: I tuoi artisti:

# HomeErrPlaylist
source: You don't have any playlist yet!
it: Non hai ancora nessuna playlist!

# HomeErrArtists
source: You don't have any favourite artist yet!
it: Non hai ancora nessun artista preferito!

# UserTitle
source: User Profile
it: Profilo Utente

# UserBestScore
source: Best Score: {bestScore}
it: Miglior punteggio: {bestScore}

# UserQuiz
source: My Best Quiz
it: Il mio miglior Quiz

# UserRank
source: Global Rank
it: Classifica Globale

# QuizGenTitle
source: New Quiz
it: Nuovo quiz

# QuizGenScore
source: Score: {totalScore} Level: {level}
it: Punteggio: {totalScore} Livello: {level}

# QuizGenNextLevel
source: You got {questionNumber} questions right!
it: Hai risposto correttamente a {questionNumber} domande!

# QuizGenNextMessage
source: Press the button Continue to go to the level {level} Otherwise press the button Exit
it: Premi il pulsante Continua per procedere al livello {level} Altrimenti premi il pulsante Esci

# QuizGenGoOnButton
source: Continue
it: Continua

# QuizGenExitButton
source: Exit
it: Esci

# ResultTitle
source: You missed a question!
it: Hai commesso un errore!

# ResultMessage
source: You got {score}
it: Punteggio: {score}

# ResultButton
source: Exit
it: Esci

# ResultPosition
source: Save the Position of the Quiz
it: Salva la Posizione del Quiz

# ResultPicture
source: Save a Picture of the Quiz
it: Salva una Foto del Quiz

# SpotyTitle
source: Authorize access to Spotify
it: Autorizza accesso a Spotify

# GlobalTitle
source: Leaderboard
it: Classifica Globale

# GlobalBestScore
source: Best score: {score}
it: Miglior punteggio: {score}

# GlobalPosition
source: Position
it: Posizione

# GlobalLocation
source: Country
it: Paese

# GlobalScore
source: Score
it: Punteggio

# GlobalErr
source: There Are No Players
it: Non ci sono giocatori!

# BestQuizTitle
source: My Best Quiz
it: Il Mio Miglior Quiz

# BestQuizScore
source: Your best score is
it: Il tuo miglior risultato è

# PositionDisabled
source: Location services are disabled. Please enable the services
it: La Localizzazione è disattivata. Per favore, attivala

# PositionDenied
source: Location permissions are denied
it: I permessi di localizzazione sono stati negati

# PositionSuperDenied
source: Location permissions are permanently denied, we cannot request permissions
it: Permessi di localizzazione negati permanentemente, non è possibile richiedere i permessi

# PositionError
source: Error
it: Errore

# QuestionArtist11
source: When was the album:
it: Quando è stato rilasciato l'album

# QuestionArtist21
source: Which track is in the album
it: Quale canzone è presente nell'album

# QuestionArtist31
source: Which track is NOT in the album
it: Quale canzone NON è nell'album

# QuestionArtist41
source: Which song is it
it: Che canzone è

# QuestionPlaylist11
source: Who has released
it: Chi ha rilasciato

# QuestionPlaylist21
source: Which album contains
it: Quale album contiene

# QuestionPlaylist31
source: Which song is it
it: Che canzone è
